#include <stdio.h>
#include "ui.h"

// ANSI escape functions
void clear_screen(void) {
    printf(CLEAR_SCREEN);
    fflush(stdout);
}

// Graphics
void display_title(void) {
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    printf("░░░░░░░░░░█░█░█▀█░█▀▀░█▀█░▀█▀░█▀█░░░░░░░░░░\n");
    printf("░░░░░░░░░░█░█░█░█░█▀▀░█▀█░░█░░█▀▄░░░░░░░░░░\n");
    printf("░░░░░░░░░░▀▀▀░▀░▀░▀░░░▀░▀░▀▀▀░▀░▀░░░░░░░░░░\n");
    printf("░░▀█▀░▀█▀░█▀▀░░░▀█▀░█▀█░█▀▀░░░▀█▀░█▀█░█▀▀░░\n");
    printf("░░░█░░░█░░█░░░░░░█░░█▀█░█░░░░░░█░░█░█░█▀▀░░\n");
    printf("░░░▀░░▀▀▀░▀▀▀░░░░▀░░▀░▀░▀▀▀░░░░▀░░▀▀▀░▀▀▀░░\n");
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");   
    fflush(stdout);
}

void display_menu_options(void) {
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    printf("░░                                       ░░\n");
    printf("░░  Start (s)                            ░░\n");
    printf("░░  About (a)                            ░░\n");
    printf("░░  Quit  (q)                            ░░\n");
    printf("░░                                       ░░\n");
    printf("░░                                       ░░\n");
    printf("░░                                       ░░\n");
    printf("░░                                       ░░\n");
    printf("░░                             by kashi  ░░\n");
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    fflush(stdout);
}
